Vapi27/gottfa-esp32/src/arena_net.cpp
#include <WiFi.h>
#include <esp_netif.h>
#include <esp_wifi.h>
#include <LittleFS.h>
#include <ESPmDNS.h>
#include <ESPAsyncWebServer.h>
#include <Preferences.h>
// esp_read_mac : dans esp_mac.h depuis IDF 5, dans esp_system.h avant.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_mac.h>
#else
#include <esp_system.h>
#endif
#include <Update.h>
#include <esp_ota_ops.h>
#include <esp_partition.h>   // ecriture directe de la partition fichiers
// Empreinte de build exposee dans /api/state. L'en-tete a demenage entre les
// versions de l'IDF : esp_app_desc.h n'existe qu'a partir de la 5, alors que le
// build Arduino/PlatformIO tourne encore sur la 4.4. Meme structure, deux noms.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_app_desc.h>
#define ARENA_APP_DESC() esp_app_get_description()
#else
#include <esp_ota_ops.h>
#define ARENA_APP_DESC() esp_ota_get_app_description()
#endif

#ifdef ARENA_MATTER
// Definies dans arena_matter.cpp : ce fichier n'inclut aucun en-tete Matter.
extern "C" uint8_t arena_matter_fabrics();
extern "C" void    arena_matter_forget();
extern "C" const char* arena_matter_last_event();
extern "C" void arena_matter_event_log(char* out, size_t n);
#endif   // OTA en mode pull (voir pullOta plus bas)
#include "arena_config.h"
#include "arena_net.h"
#include "arenaled.h"
#include "arena_map.h"
#include "arena_pf.h"
#include "arena_attract.h"
#include "arena_oled.h"
#include "arena_peers.h"

namespace arenanet {

static AsyncWebServer s_server(80);
static Preferences    s_prefs;

// Identite de la carte. La MAC est gravee en usine, donc unique sans reglage ni
// numero de serie a gerer : deux murs sortis de la meme image ne peuvent pas se
// confondre. Le proprietaire peut ensuite mettre "Volcano" ou "Arena".
static String         s_name;
static String         s_mac;

const String& wallName() { return s_name; }

// Un nom d'hote mDNS n'accepte ni espace ni accent ni majuscule.
static String hostify(const String& in) {
  String o;
  for (size_t i = 0; i < in.length(); i++) {
    char c = in[i];
    if (c >= 'A' && c <= 'Z') c += 32;
    if ((c >= 'a' && c <= 'z') || (c >= '0' && c <= '9')) o += c;
    else if (o.length() && o[o.length()-1] != '-')       o += '-';
  }
  while (o.length() && o[o.length()-1] == '-') o.remove(o.length()-1);
  return o.length() ? o : String("playfield");
}
static String         s_ip   = "0.0.0.0";
static String         s_mode = "init";

const char* ip()   { return s_ip.c_str(); }



const char* mode() { return s_mode.c_str(); }

// Served when LittleFS is empty (nobody ran `pio run -e arenaled -t uploadfs` yet):
// enough UI to prove the chain lights up and to reach the mode buttons.
static const char FALLBACK[] PROGMEM =
  "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
  "<title>Arena LED</title><style>body{background:#111;color:#eee;font:16px system-ui;padding:2em}"
  "a{display:inline-block;margin:.3em;padding:.6em 1em;background:#c60;color:#fff;"
  "text-decoration:none;border-radius:6px}</style><h1>Arena LED</h1>"
  "<p>Web UI not uploaded yet — run <code>pio run -e arenaled -t uploadfs</code>.</p>"
  "<p><a href='/api/set?mode=classic'>classic</a><a href='/api/set?mode=attract'>attract</a>"
  "<a href='/api/set?mode=arena'>arena</a><a href='/api/set?mode=night'>night</a>"
  "<a href='/api/set?mode=rainbow'>rainbow</a><a href='/api/set?mode=test'>test</a>"
  "<a href='/api/set?mode=off'>off</a></p><p><a href='/api/state'>/api/state</a></p>";

// Compteurs exportes par libs/Adafruit_NeoPixel/esp.c : ils disent si la sortie
// RMT part vraiment, ou si rmtInit() echoue (carte hors USB, donc pas de log).
extern "C" {
  extern volatile uint32_t espShowRmtFail, espShowFrames, espShowLockMiss;
  extern volatile int32_t  espShowBusType;
}

// --- OTA en mode "pull" ----------------------------------------------------
// Le POST /update pousse l'image depuis le callback AsyncTCP. Sur S3 ca tue la
// carte : Update.begin() efface la partition, ce qui bloque la tache AsyncTCP
// plusieurs secondes pendant que le client continue d'envoyer - lwIP manque de
// tampons et le chip tombe. Mesure du 2026-08-02 : 250 ko recus sur 1,6 Mo, puis
// un redemarrage qui ressemble a s'y meprendre a une mise a jour reussie.
//
// Ici c'est la carte qui va chercher l'image : elle lit au rythme qu'elle veut,
// donc rien ne s'accumule, et l'effacement se fait pendant que personne ne
// pousse. On passe aussi la taille reelle a esp_ota_begin() au lieu de
// OTA_SIZE_UNKNOWN, qui effacait les 3 Mo entiers de la partition.
static String        s_pullUrl;
static volatile bool s_pullPending = false;
static String        s_pullStatus  = "idle";
static uint32_t      s_pullDone = 0, s_pullTotal = 0;
static bool          s_pullFs = false;   // application ou systeme de fichiers

// Balayage WiFi. Lance depuis la boucle principale, jamais depuis un handler :
// WiFi.scanNetworks() bloque 2 a 5 s, et bloquer la tache AsyncTCP est
// exactement ce qui tuait la carte pendant les mises a jour.
static volatile bool s_scanWanted = false;
static String        s_scanJson   = "[]";
static uint32_t      s_scanAt     = 0;

// Envoi par morceaux depuis le navigateur (/api/fw).
static esp_ota_handle_t     s_fwHandle = 0;
static const esp_partition_t* s_fwPart = nullptr;
static size_t               s_fwTotal = 0, s_fwGot = 0;
static uint32_t             s_fwReboot = 0;   // 0 = pas de redemarrage arme

static bool pullOta(const String& url, bool fs, String& err) {
  if (!url.startsWith("http://")) { err = "seul http:// est supporte"; return false; }
  const int slash     = url.indexOf('/', 7);
  const String hostp  = (slash < 0) ? url.substring(7) : url.substring(7, slash);
  const String path   = (slash < 0) ? "/" : url.substring(slash);
  const int colon     = hostp.indexOf(':');
  const String host   = (colon < 0) ? hostp : hostp.substring(0, colon);
  const uint16_t port = (colon < 0) ? 80 : (uint16_t)hostp.substring(colon + 1).toInt();

  WiFiClient c;
  if (!c.connect(host.c_str(), port)) { err = "connexion refusee " + hostp; return false; }
  c.print(String("GET ") + path + " HTTP/1.1\r\nHost: " + hostp +
          "\r\nConnection: close\r\nAccept-Encoding: identity\r\n\r\n");

