Vapi27/gottfa-esp32/src/arena_net.cpp
  // Qui est ce mur. Indispensable des qu'il y en a plusieurs : c'est ce qui
  // permet de balayer le reseau et de dire lequel est lequel.
  j += ",\"name\":\"" + s_name + "\"";
  j += ",\"mac\":\""  + s_mac  + "\"";

  // OTA en mode pull : ou en est le telechargement declenche par /api/otapull.
  j += ",\"otast\":\""  + s_pullStatus + "\"";
  j += ",\"otadone\":"  + String(s_pullDone);
  j += ",\"otatot\":"   + String(s_pullTotal);
  j += ",\"fwgot\":"   + String((uint32_t)s_fwGot);
  j += ",\"fwtot\":"   + String((uint32_t)s_fwTotal);
#ifdef ARENA_MATTER
  // A combien de maisons la carte appartient. Si Maison dit "deja dans une autre
  // maison", c'est ce nombre qu'il faut regarder avant de conclure quoi que ce soit.
  j += ",\"fabrics\":" + String((int)arena_matter_fabrics());
  j += ",\"mev\":\"" + String(arena_matter_last_event()) + "\"";
  { char ev[560]; arena_matter_event_log(ev, sizeof(ev));
    j += ",\"mevlog\":\"" + String(ev) + "\""; }
#endif
  // Empreinte de build : les 8 premiers octets du SHA256 de l'ELF. C'est le SEUL
  // champ qui prouve qu'une OTA a bien remplace l'image - l'uptime ne prouve
  // rien (un envoi qui plante redemarre la carte exactement pareil), et un
  // compteur remis a zero au boot non plus.
  {
    const esp_app_desc_t* d = ARENA_APP_DESC();
    char sha[17];
    for (int i = 0; i < 8; i++) sprintf(sha + i * 2, "%02x", d->app_elf_sha256[i]);
    sha[16] = 0;
    j += ",\"build\":\"" + String(sha) + "\"";
  }
  j += ",\"ip\":\""   + s_ip + "\",\"net\":\"" + s_mode + "\"";
  j += ",\"up\":"     + String(millis() / 1000);
  j += ",\"heap\":"   + String(ESP.getFreeHeap());
  j += "}";
  return j;
}

static uint8_t param8(AsyncWebServerRequest* r, const char* k, uint8_t cur) {
  if (!r->hasParam(k)) return cur;
  long v = r->getParam(k)->value().toInt();
  if (v < 0) v = 0;
  if (v > 255) v = 255;
  return (uint8_t)v;
}

static void startServer() {
  // --- UI ---------------------------------------------------------------
  s_server.on("/", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (LittleFS.exists("/arena.html")) r->send(LittleFS, "/arena.html", "text/html");
    else                                r->send_P(200, "text/html", FALLBACK);
  });

  // --- State / control ----------------------------------------------------
  s_server.on("/api/state", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", stateJson());
  });

  //  /api/set?mode=arena&bright=180&speed=128&r=255&g=100&b=0&w=0&count=100&budget=9000&order=grbw
  s_server.on("/api/set", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("mode")) {
      arenaled::Mode m = arenaled::modeFromName(r->getParam("mode")->value().c_str());
      if (m == arenaled::MODE_COUNT) { r->send(400, "text/plain", "bad mode"); return; }
      arenaled::setMode(m);
    }
    if (r->hasParam("bright")) arenaled::setBrightness(param8(r, "bright", arenaled::brightness()));
    if (r->hasParam("speed"))  arenaled::setSpeed(param8(r, "speed", arenaled::speed()));
    if (r->hasParam("gi"))     arenaled::setGi(param8(r, "gi", arenaled::gi()));
    if (r->hasParam("density")) arenaled::setDensity(param8(r, "density", arenaled::density()));
    if (r->hasParam("warm"))   arenaled::setWarm(param8(r, "warm", arenaled::warm()));
    if (r->hasParam("inc"))    arenaled::setIncandescent(r->getParam("inc")->value().toInt() != 0);
    if (r->hasParam("boot"))   arenaled::setBootOn(r->getParam("boot")->value().toInt() != 0);
    if (r->hasParam("r") || r->hasParam("g") || r->hasParam("b") || r->hasParam("w")) {
      arenaled::Rgbw c = arenaled::color();
      c.r = param8(r, "r", c.r);
      c.g = param8(r, "g", c.g);
      c.b = param8(r, "b", c.b);
      c.w = param8(r, "w", c.w);
      arenaled::setColor(c);
    }
    if (r->hasParam("order")) {
      if (!arenaled::setOrder(r->getParam("order")->value().c_str())) {
        r->send(400, "text/plain", "bad order (grbw|rgbw|gbrw|brgw|rbgw|bgrw)");
        return;
      }
    }
    if (r->hasParam("count"))  arenaled::setCount((uint16_t)r->getParam("count")->value().toInt());
    if (r->hasParam("budget")) arenaled::setBudgetMa((uint16_t)r->getParam("budget")->value().toInt());
    r->send(200, "application/json", stateJson());
  });

  // /api/latch?n=L9,L48   lamps held lit through attract, by the MACHINE's name
  // /api/latch?clear=1    release them all
  // Named, not numbered: the owner reads L9 off the playfield, and the mask
  // underneath is in PinMAME's numbering, which nobody should have to know.
  s_server.on("/api/latch", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("clear")) { arenaled::setLatched(0); arenaled::save(); }
    else if (r->hasParam("n")) {
      uint64_t m = 0;
      String list = r->getParam("n")->value();
      list.trim();
      int start = 0;
      while (start < (int)list.length()) {
        int comma = list.indexOf(',', start);
        if (comma < 0) comma = list.length();
        String one = list.substring(start, comma);
        one.trim();
        start = comma + 1;
        if (!one.length()) continue;
        const int idx = arenapf::indexOf(one.c_str());
        const arenapf::Insert* ins = (idx >= 0) ? arenapf::insert((uint8_t)idx) : nullptr;
        if (!ins || ins->lamp < 0) {
          r->send(400, "text/plain", "unknown insert: " + one);
          return;
        }
        m |= (1ULL << ins->lamp);
      }
      arenaled::setLatched(m);
      arenaled::save();
    }
    // Answer in the owner's names, not in the internal mask.
    String out = "{\"latched\":[";
    bool first = true;
    const uint64_t m = arenaled::latched();
    for (uint8_t i = 0; i < arenapf::insertCount(); i++) {
      const arenapf::Insert* ins = arenapf::insert(i);
      if (!ins || ins->lamp < 0 || !((m >> ins->lamp) & 1ULL)) continue;
      if (!first) out += ',';
      first = false;
      out += "\"" + String(ins->name) + "\"";
    }
    out += "]}";
    r->send(200, "application/json", out);
  });

  //  /api/music?e=..&b=..&t=..   0..255 — drive the music mode from anything
  //  that can hit REST at ~20 Hz. Overrides the on-board mic for 2 s per push.
  s_server.on("/api/music", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenaled::musicPush(param8(r, "e", 0), param8(r, "b", 0), param8(r, "t", 0));
    r->send(200, "text/plain", "ok");
  });

  s_server.on("/api/save", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenaled::save();
    r->send(200, "text/plain", "saved");
  });

  // --- Mapping wizard -----------------------------------------------------
  //  /api/identify?led=42 | ?zone=3 | ?clear=1   (ms= optional, default 10 s)
  s_server.on("/api/identify", HTTP_GET, [](AsyncWebServerRequest* r) {
    uint32_t ms = r->hasParam("ms") ? (uint32_t)r->getParam("ms")->value().toInt() : 10000;
    if (r->hasParam("clear"))     arenaled::clearIdentify();
    else if (r->hasParam("led"))  arenaled::identifyLed(r->getParam("led")->value().toInt(), ms);
    else if (r->hasParam("zone")) arenaled::identifyZone(r->getParam("zone")->value().toInt(), ms);
    else { r->send(400, "text/plain", "led= | zone= | clear=1"); return; }
    r->send(200, "text/plain", "ok");
  });

  // ---- Sub-paths must be registered BEFORE their parent --------------------
  // This server matches a handler when the request URL equals its URI *or*
  // starts with it followed by '/'. So "/api/zones" also answers
  // "/api/zones/reset", and whichever was registered first wins. Registered the
  // other way round, /api/zones/reset silently returned the zone list and the
  // UI's "Reset to template" button did nothing at all - which is exactly what
  // it had been doing, unnoticed, since there was no hardware to try it on.
  s_server.on("/api/zones/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenamap::reset();
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });

  s_server.on("/api/ledmap/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenapf::clearAssignment();
    arenapf::save();
    r->send(200, "text/plain", "cleared");
  });

  s_server.on("/api/zones", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", arenamap::toJson());
  });

